Tekla Open API Reference for Tekla Structures 2025
Localization.Localize Method (ApplicationSettingsBase)
 Localizes application settings.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Localize(
	ApplicationSettingsBase applicationSettings
)
Public Sub Localize (
	applicationSettings As ApplicationSettingsBase
)
Parameters
applicationSettings
Type: System.Configuration.ApplicationSettingsBase
The application settings that should be localized.
See Also
Reference
Localization Class
Localize Overload
Tekla.Structures.Dialog Namespace